app/services/application_service/create_application.rb

        def create_application
            @application = Application.create!({
                name: @name,
                token: @token
            })
---
INSERT INTO `applications` (`name`, `token`, `created_at`, `updated_at`) VALUES ('app from solidohuuuh s ', 'mkMbMLGnUlxFdCkbBRniQjJXSjgkQVgSEMPxzLdUrZCRuesXaV', '2022-01-27 10:07:23', '2022-01-27 10:07:23')