lib/tasks/elasticsearch_start.rake

task elasticsearch_start: [:environment] do
  Message.import force: true unless Message.all.empty?
---
SELECT  1 AS one FROM `messages` LIMIT 1