app/workers/chat_worker.rb

    def work(raw_chat)
        raw_chat= JSON.parse(raw_chat)
        chat = Chat.new
        chat.number = raw_chat['number']
        chat.application= Application.find(raw_chat['application_id'])
        chat.save!
---
SELECT  `applications`.* FROM `applications` WHERE `applications`.`id` = 5 LIMIT 1
INSERT INTO `chats` (`number`, `application_id`, `created_at`, `updated_at`) VALUES (2, 5, '2022-01-26 16:21:05', '2022-01-26 16:21:05')