app/workers/message_worker.rb

SELECT  `chats`.* FROM `chats` WHERE `chats`.`id` = 79 LIMIT 1
INSERT INTO `messages` (`body`, `number`, `chat_id`, `created_at`, `updated_at`) VALUES ('foreman1', 1, 79, '2022-01-28 12:20:29', '2022-01-28 12:20:29')
---
    def work(raw_message)
        ActiveRecord::Base.connection_pool.with_connection do
            raw_message= JSON.parse(raw_message)
            message = Message.new
            message.number = raw_message['number']
            message.body = raw_message['body']
            message.chat = Chat.find(raw_message['chat_id'])
            message.save!