app/controllers/api/v1/applications_controller.rb

SELECT `applications`.* FROM `applications`
---
  def index
    @applications = Application.all

INSERT INTO `applications` (`name`, `token`, `created_at`, `updated_at`) VALUES ('app2docker', 'leXdZdRXKWPkdmmiuBNsVzqarcpYpBNaDiksEmeTaZdgtPZdMF', '2022-01-25 19:01:40', '2022-01-25 19:01:40')
---
  def create
    @application = ApplicationService::CreateApplication.new(params[:name]).call
    if @application.save!

SELECT  `applications`.* FROM `applications` WHERE `applications`.`token` = 'mkMbMLGnUlxFdCkbBRniQjJXSjgkQVgSEMPxzLdUrZCRuesXaV' LIMIT 1
---
    def set_application
      @application = Application.find_by(token: params[:token])