app/controllers/api/v1/chats_controller.rb

INSERT INTO `chats` (`number`, `application_id`, `created_at`, `updated_at`) VALUES (1, 1, '2022-01-24 22:19:09', '2022-01-24 22:19:09')
---
  def create
    @chat = @application.chats.build

    if @chat.save

SELECT  `chats`.* FROM `chats` WHERE `chats`.`application_id` = 6 AND `chats`.`number` = 2 LIMIT 1
---
    def set_chat
      @chat = @application.chats.find_by(number: params[:number])

SELECT  `applications`.* FROM `applications` WHERE `applications`.`token` = 'prxSTuZOtlMlvHmpTwvrydKIKaUJwLqASlJUcLfNGAHXWrGKzv' LIMIT 1
---
    def set_application
      @application = Application.find_by(token: params[:application_token])