app/controllers/api/v1/messages_controller.rb

INSERT INTO `messages` (`body`, `number`, `chat_id`, `created_at`, `updated_at`) VALUES ('hello chat 2 app 1', 1, 69, '2022-01-26 16:38:07', '2022-01-26 16:38:07')
---
    def create
        @message = @chat.messages.build(message_params)
        @message.number = get_new_message_number
        PublisherService.publish("messages",@message)
        if @message.save!

SELECT  `applications`.* FROM `applications` WHERE `applications`.`token` = 'gTNVPLJsDdMArRQfGsrhucwKNioFLrdMricHsFFjSCZtMdgPbL' LIMIT 1
---
    def set_application
        @application = Application.find_by(token: params[:application_token])

SELECT  `chats`.* FROM `chats` WHERE `chats`.`application_id` = 6 AND `chats`.`number` = 2 LIMIT 1
---
    def set_chat
        @chat = @application.chats.find_by(number: params[:chat_number])

SELECT  `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 73 AND `messages`.`number` = 1 LIMIT 1
---
    def set_message
        @message = @chat.messages.find_by(number: params[:number])