app/controllers/api/v1/messages_controller.rb

SELECT `messages`.* FROM `messages` WHERE 1=0
---
      def search
        @messages = Message.partial_search(params['query'], @chat).results.to_a

UPDATE `messages` SET `body` = 'hell', `updated_at` = '2022-01-27 12:20:33' WHERE `messages`.`id` = 15
---
      def update
        if @message.update(message_params)