app/models/chat.rb

  def generate_chat_number
    self.number = self.application.chats.count + 1
---
SELECT COUNT(*) FROM `chats` WHERE `chats`.`application_id` = 1